InformationRegisters/бит_ЗамечанияПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗамечанияПоЛС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьНаПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НаправленияПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_НаправленияПечатиЗамечаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЗамечанияПоЛС/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
		Если НЕ ЗначениеЗаполнено(Запись.Номер) Тогда
			
		ПолучитьНомерЛицевойСчетНаСервере();	
			
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
		Элементы.ЛицевойСчет.Доступность = ?(ЗначениеЗаполнено(Запись.ЛицевойСчет), Ложь, Истина);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда

		Запись.ДатаЗаписи = ТекущаяДата();
		
		Запись.ЛицевойСчет = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура  ПолучитьНомерЛицевойСчетНаСервере()
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	бит_ЗамечанияПоЛС.ЛицевойСчет,
		|	бит_ЗамечанияПоЛС.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.бит_ЗамечанияПоЛС КАК бит_ЗамечанияПоЛС
		|ГДЕ
		|	бит_ЗамечанияПоЛС.ЛицевойСчет = &ЛицевойСчет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
		Запрос.УстановитьПараметр("ЛицевойСчет", Запись.ЛицевойСчет);
		ТабЗначЗапрос = Запрос.Выполнить().Выгрузить();
		
		Если  ТабЗначЗапрос.Количество()=0  Тогда
			
			Запись.Номер = 1;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ТабЗначЗапрос[0].Номер) Тогда
			Запись.Номер = 1;
		Иначе
			Запись.Номер = Число(ТабЗначЗапрос[0].Номер) + 1;
		КонецЕсли; 
		
КонецПроцедуры	

#КонецОбласти
